caAERS/software/jbi/caaers2adeers-sync/core-test-su/src/main/resources/xslt/test.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:com="http://schema.integration.caaers.cabig.nci.nih.gov/common">
    <soapenv:Header xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
        <wsse:Security>
            <wsse:UsernameToken>
                <wsse:Username>SYSTEM_ADMIN</wsse:Username>
                <wsse:Password>Hello-12</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <com:createOrUpdateAgent>
            <com:Agents>
                <com:agent>
                    <name>2-Fluoroadenosine</name>
                    <descriptionText>2-Fluoroadenosine</descriptionText>
                    <nscNumber>30605</nscNumber>
                    <status>Active</status>
                </com:agent>
                <com:agent>
                    <name>5-Fluoro-2'-deoxycytidine (FdCyd)</name>
                    <descriptionText>5-Fluoro-2'-deoxycytidine (FdCyd)</descriptionText>
                    <nscNumber>48006</nscNumber>
                    <status>Inactive</status>
                </com:agent>
                <com:agent>
                    <name>5-Fluorouracil (5-FU)</name>
                    <descriptionText>5-Fluorouracil (5-FU)</descriptionText>
                    <nscNumber>19893</nscNumber>
                    <status>Inactive</status>
                </com:agent>
                <com:agent>
                    <name>Beta-Fluoro-ddA (Lodenosine)</name>
                    <descriptionText>Beta-Fluoro-ddA (Lodenosine)</descriptionText>
                    <nscNumber>613792</nscNumber>
                    <status>Active</status>
                </com:agent>
                <com:agent>
                    <name>Beta-random12413582</name>
                    <descriptionText>Beta-random12413582</descriptionText>
                    <nscNumber>12413582</nscNumber>
                    <status>Active</status>
                </com:agent>
            </com:Agents>
        </com:createOrUpdateAgent>
    </soapenv:Body>
</soapenv:Envelope>